{"pageProps":{"board":[{"name":"Cornelia (Conny) Scheitz","role":"president","image":true,"meta":{"email":"cscheitz@jacobs-alumni.de","linkedin":"https://www.linkedin.com/in/cornelia-scheitz/"},"description":"Cornelia Scheitz ('07) joins the Alumni Board as it's president. \n\nAt work, she leads the Program and Business Excellence team for the Platform Services and Emerging Technologies group at Autodesk. Her team aligns and empowers developers across Autodesk to drive platform outcomes for our customers. Conny has a Ph.D. in life sciences and spent the last 10 years driving innovation in science in technology. Outside of Autodesk and the Alumni Board, Conny also leads the Jacobs University Foundation of America. "},{"name":"Albena Bogoeva","role":"vice-president","image":true,"meta":{"email":"abogoeva@jacobs-alumni.de","facebook":"https://www.facebook.com/albenab","linkedin":"https://www.linkedin.com/in/abogoeva/"},"description":"Albena ('14) is joining the Alumni Board to strengthen its public presence in the community and support its communication efforts to motivate more people to be active members and uphold the Jacobs spirit.\n\nAfter graduating from Jacobs with a BSc in Information Management and Systems in 2014, she finished her MSc in Business Informatics at the University of Mannheim. At Jacobs, she coordinated the Rotaract Club, was a member of the Stage, Light, Sound Crew, a proud Pulse Express employee and passionate C3 resident. She is currently working as a management consultant in Mannheim, helping customers succeed in their digital transformations in the area of procurement."},{"name":"Johannes Huber","role":"secretary","image":true,"meta":{"email":"jhuber@jacobs-alumni.de","linkedin":"https://www.linkedin.com/in/johannes-huber-879b26176/"},"description":"Johannes ('15) is new."},{"name":"Leonhard Kuboschek","role":"treasurer","image":true,"meta":{"email":"leo@jacobs-alumni.de","instagram":"https://www.instagram.com/myinstaisleo","twitter":"https://twitter.com/kuboschek","linkedin":"https://www.linkedin.com/in/kuboschek","github":"https://github.com/kuboschek"},"description":"Leo ('17) is a technical consultant at DXC in Zürich, Switzerland. \n\nWhen he's not writing enterprise-grade software, you'll find him on his road bike chasing KOMs on Strava. While studying Computer Science at Jacobs, he was a member of the Rowing Team, Head of IT for the Undergraduate Student Government, as well as being team lead for the Stage, Light and Sound group of Campus Life. As the treasurer, he has automated issuing donation receipts and will continue to work on establishing an alumni fund."},{"name":"Celia Amelie Anneliese Ursel Schiller","role":"events","image":true,"meta":{"email":"cschiller@jacobs-alumni.de"},"description":"Celia Schiller ('21) graduated from Jacobs University in Bremen with a Bachelor of Arts in International Relations after finishing her secondary education as a German national in the United States. She developed a keen interested for security studies during her undergraduate studies and practically applied those interests with an internship at the Federal Academy for Security Policy in Berlin and at the U.S. Consulate General in Hamburg.\n\nShe has worked as a Business Intelligence Trainee at Rheinmetall Defence and starts as a Fellow at BwConsulting while pursuing a Master of International Affairs & International Security at the Hertie School in Berlin. At JUB, she has been a member of the Nordmetall College Office Team and the Graduate Housing Coordinator for the Housing Department."},{"name":"Nouria Jantz-Naeem","role":"fundraising","image":true,"meta":{"email":"njantz-naeem@jacobs-alumni.de"},"description":"Nouria ('18) is currently studying her M.Sc. in medical and clinical Immunology in Magdeburg. At Jacobs University she graduated with a B.Sc. in Earth and Environmental Sciences and was involved in various student clubs and organizations and acted as the President of the Undergraduate Student Government. \n\nNouria has now taken over the role of Assessor for Fundraising and is excited about working hard on exploring long-term and sustainable fundraising and financing avenues for the Association!"},{"name":"Tom Wiesing","role":"it","image":true,"meta":{"email":"tom@jacobs-alumni.de","github":"https://github.com/tkw1536"},"description":"Tom ('15, '17) currently pursues a PhD in Computer Science as part of the KWARC research group in Erlangen, Germany. \n\nHe graduated from Jacobs with a BSc in Applied and Computational Mathematics in 2015. He also received an MSc at Jacobs as part of the first class of Data Engineering in 2017. During his time at Jacobs, he was president of the GSA in the 2016 - 2017 academic year. As Assessor for Information Technology, he will focus on coding and supporting all IT systems of the Alumni, supported by a team of volunteer coders."},{"name":"Raju Gurung","role":"network-development","image":true,"meta":{"email":"rgurung@jacobs-alumni.de","linkedin":"https://www.linkedin.com/in/rajugurung/"},"description":"Raju ('14) comes from the Himalayas of Nepal, and has been a steward of Jacobs spirit fostering many collaborations among alumni and Jacobs students. With his newly established board role, he wishes to unleash the potential of Jacobs network. \n\nAfter Bachelors in Biology & Neuroscience at Jacobs, he did a Masters in Business Administration & Bio-entrepreneurship in Copenhagen. In the aftermath of the 2015 Nepal earthquake, he co-founded social impact venture PlanetLocal and started a boutique brand IKIGAAI to empower small independent artisans and brands. Since 2017, he also consults and advises leading biotech and foodtech companies like Chr. Hansen to create resilient futures and to drive impactful innovation through biology. When he's not working, he meditates, explores art, cuisine & culture, does photography, engages in philanthropy & coaches entrepreneurs & students to design purposeful lives. "},{"name":"Alena Di Primio","role":"pr","image":true,"meta":{"email":"adiprimio@jacobs-alumni.de","linkedin":"https://www.linkedin.com/in/adiprimio"},"description":"Alena ('16) graduated Jacobs with a Bachelor in Biotechnology. Alena continued her studies at the Technical University Denmark (DTU) and completed a Master in Biotechnology. She is currently finishing up her PhD at the Netherlands Institute for Sea Research (NIOZ). However, like most people in academia, she is fed up with the system and is planning on switching over to industry and pursue a career in Project Management once she's done with her PhD. At Jacobs she was known for being the go to person for event organization, so it seemed like a good way to go. \n\n With (often stupid) jokes on her lips at most times, no capability of telling lies (her tell is that she smiles when she's hiding something and easily gets anxious when questioned, so it's very obvious), and an OCD like need of having a cleared notification board, she will be a reliable correspondent and support. She is always happy talk about and get feedback from the alumni on any and all topics (including food, books, food, comics/manga, food, and if need be - how to improve the Alumni Association and communication)."},{"name":"Zain Dar","role":"member-management","image":true,"meta":{"email":"zdar@jacobs-alumni.de","linkedin":"https://www.linkedin.com/in/zainsalmandar/"},"description":"Zain ('19) is new."}],"advisors":[{"name":"Dr. Christian Jacobs","image":true,"role":"Managing Partner Joh. Jacobs & Co. (AG & Co.) KG, Hamburg/Honorary Chairman, Jacobs Foundation, Zurich/Vice Chairman of the Jacobs University Board of Governors","description":"Johann Christian Jacobs is the oldest son of entrepreneur and Jacobs University’s name patron Klaus J. Jacobs and has led Jacobs Foundation involvment in Jacobs University ever since the commitment of Jacobs Foundation of 200 million euros in 2006.\n\nAfter growing up in Bremen, he is now a lawyer and entrepreneur based in Hamburg as managing partner of Joh. Jacobs &amp; Co. (AG &amp; Co.) KG, a company having become known for successful investments in companies such as Infront Sports &amp; Media, CeWe Color Holding AG and Hemro AG.\n\nSince 2001 he took over various positions within the Jacobs family group, from 2001 – 2004 as Chairman of Jacobs Holding, being the investment company invested in Barry Callebaut AG, Adecco S.A. and Infront Sports &amp; Media, and from 2004 – 2015 as Chairman of the Jacobs Foundation, one of the largest private foundations in Europe, based in Zurich (Switzerland). He became its Honorary Chairman in 2015.\n\nBesides his vice chairmanship on the Board of Governors of Jacobs University Bremen, he is also a board member of the German Council on Foreign Relations, a think-tank for German foreign policy, Board of Trustees of the Society of Friends of Bayreuth eV and a member of the Senate of Berlin-Brandenburg Academy of Sciences and the acatech – German academy of technology."},{"name":"Prof. Dr. Karen Smith Stegen","image":true,"role":"KAEFER Professor of Renewable Energy and Environmental Politics / Research Fellow at the Bremer Energie Insitute","description":"Professor Dr. Karen Smith Stegen is the KAEFER Chair of Renewable Energy and Environmental Politics. She holds an international MBA (1989) and was the Senior International Affairs Analyst at Amoco Corporation in Chicago, Illinois (1989-1995). Prior to obtaining her Ph.D. in Political Science from Northwestern University in 2008, she was awarded fellowships from both the Fulbright Commission and the German Academic Exchange Service (DAAD). She was an adjunct faculty member of Universität Heidelberg and Schiller International University (2008-2009) and a senior researcher with the Bremer Energie Institut (2009-2011).\n\nAt Jacobs University, Prof. Dr. Smith Stegen teaches courses on social movements, sustainability, energy and environmental policy and politics, and international relations. She is one of the founders of the Integrated Environmental Studies undergraduate program and is the coordinator of the Energy Policy &amp; Technology specialization. Prof. Dr. Smith Stegen has published in Energy Policy, Risk Management, Energy Conversion and Management, the Journal of Transatlantic Studies, the Journal of Eurasian Studies, and the International Journal of Emerging Markets. She is frequently a featured speaker at conferences and has been called upon to provide expertise to policy makers, including the European Presidency."},{"name":"Prof. Dr. Ronny Wells","image":true,"role":"President of the Board of Directors of the Jacobs Foundation of America / Distinguished Professor of Mathematics","description":"Raymond O. WELLS, Jr., received his Ph.D. degree from the Courant Institute of Mathematical Sciences at New York University in 1965 and thereafter had a 35-year career as a mathematics professor at Rice University in Houston. He is the recipient of Fulbright, Guggenheim, and Alexander von Humboldt awards, and is a fellow of the AAAS. In 1970-71 and in 1979-80 he was a Visiting Member at the Institute for Advanced Study in Princeton, and he was a Visiting Professor at Brandeis, Paris, Oxford, Colorado, and Bremen.\n\nFrom 1998 to 2001 Wells was in Bremen working on the creation of International University Bremen. He was Vice-President for External Affairs and Professor of Mathematics at IUB from 2001-2005. In 2005 was appointed Distinguished Professor of Mathematics. He was the President of the Carl-Schurz Deutsch-Amerikanischer Club in Bremen from 2002-2010.\n\nHe is currently the President of the Jacobs University Foundation of America, based in Boulder, Colorado, and is a Member of the Board of the Jacobs University Alumni & Friends Stiftung GmbH in Bremen."}],"formers":[{"name":"Alina Degtiarova","roles":[{"role":"pr","from":2014,"to":2015}]},{"name":"Andres Alvarado","roles":[{"role":"president","from":2007,"to":2009}]},{"name":"Anna Habighorst","roles":[{"role":"treasurer","from":2015,"to":2015}]},{"name":"Anna-Lena Schindl","roles":[{"role":"network-development","from":2016,"to":2019}]},{"name":"Anne Valtink","roles":[{"role":"president","from":2016,"to":2019}]},{"name":"Beenish Waris","roles":[{"role":"fundraising","from":2018,"to":2019}]},{"name":"Ciprian Blindu","roles":[{"role":"treasurer","from":2019,"to":2020}]},{"name":"Cristina Trifon-Calvopiña","roles":[{"role":"events","from":2019,"to":2020}]},{"name":"Daniel Alfonso Garcia","roles":[{"role":"vice-president","from":2014,"to":2015}]},{"name":"Devashish Tikekar","roles":[{"role":"vice-president","from":2013,"to":2013}]},{"name":"Elena Isac","roles":[{"role":"special-projects","from":2016,"to":2019}]},{"name":"Ewa Grzechnik","roles":[{"role":"treasurer","from":2010,"to":2012}]},{"name":"Franziska Pohle","roles":[{"role":"member-management","from":2018,"to":2021}]},{"name":"Frederique Mittelstaedt","roles":[{"role":"IT","from":2016,"to":2017}]},{"name":"Iliana Heucke","roles":[]},{"name":"Irina Shames","roles":[{"role":"vice-president","from":2010,"to":2010}]},{"name":"Ivan Mandadzhiev","roles":[{"role":"pr","from":2018,"to":2018}]},{"name":"Julia Gyorffy","roles":[{"role":"special-projects","from":2011,"to":2013}]},{"name":"Konstantin Mihov","roles":[{"role":"special-projects","from":2011,"to":2013}]},{"name":"Lida-Maria Lottko","roles":[{"role":"pr","from":2016,"to":2017}]},{"name":"Marie-Chantal Lages","roles":[{"role":"member-management","from":2021,"to":2021}]},{"name":"Max Lohmann","roles":[{"role":"events","from":2016,"to":2019}]},{"name":"Melanie Wilneder","roles":[{"role":"secretary","from":2007,"to":2009}]},{"name":"Mohsin Dar","roles":[{"role":"fundraising","from":2019,"to":2019}]},{"name":"Muhammad Azka","roles":[{"role":"secretary","from":2019,"to":2022}]},{"name":"Petar Perkovic","roles":[{"role":"president","from":2010,"to":2012}]},{"name":"Peter Dabrowski","roles":[{"role":"vice-president","from":2011,"to":2012},{"role":"president","from":2013,"to":2015}]},{"name":"Philipp Herzberg","roles":[{"role":"member-management","from":2015,"to":2016}]},{"name":"Raluca Puie","roles":[{"role":"president","from":2004,"to":2006}]},{"name":"Robert Eckhoff","roles":[{"role":"special-projects","from":2007,"to":2013}]},{"name":"Răzvan Barabaș","roles":[{"role":"secretary","from":2016,"to":2019}]},{"name":"Sharon Min","roles":[{"role":"network-development","from":2019,"to":2020}]},{"name":"Stefan Anca","roles":[{"role":"secretary","from":2010,"to":2015}]},{"name":"Stefan Kuzmanovski","roles":[{"role":"treasurer","from":2016,"to":2019},{"role":"vice-president","from":2019,"to":2022}]},{"name":"Stefan Rustler","roles":[{"role":"treasurer","from":2013,"to":2016},{"role":"vice-president","from":2016,"to":2019},{"role":"president","from":2019,"to":2022}]},{"name":"Suna Turhan","roles":[{"role":"treasurer","from":2013,"to":2014}]}],"instance":"2022","prev_instance":null,"up_to_date_instance":"2022"},"__N_SSG":true}